posts/trying_floorp.html
<!DOCTYPE html><html><head><!-- 2025-03-14 --><!-- 2026-01-29 Thu 14:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Trying out floorp browser</title>
<meta name="generator" content="Org Mode" />
<link href="https://fonts.cdnfonts.com/css/share-tech-mono" rel="stylesheet"><link rel="stylesheet" type="text/css" href="/assets/code.css"/><link rel="stylesheet" type="text/css" href="/assets/style.css"/>
</head><body><header><div class="container"><h1>Gold Ayan's Tinker Garage</h1></div><div class="header-content"><nav class="container"><ul class="topnav"><li><a href="/index.html">Home</a></li><li><a href="/projects.html">Projects</a></li><li><a href="/posts">Posts</a></li><li><a href="/til.html">TIL</a></li><li><a href="/blogrolls.html">Blogrolls</a></li><li><a href="/feed.xml">RSS</a></li></ul></nav></div></header><article class="container"><div class="blog-content"><p>
I use flatpak to install floorp
</p>

<div class="org-src-container">
<pre class="src src-shell">flatpak install flathub one.ablaze.floorp
</pre>
</div>

<p>
Gone with Lepton custom theme as i need to customize the UI little bit.
</p>

<p>
Disabled the following
</p>
<ul class="org-ul">
<li>Tabs</li>
<li>Side bar heading</li>
<li>removed few unnecessary menu items in the menu bar</li>
</ul>

<p>
Addons
</p>
<ul class="org-ul">
<li>Firefox containers</li>
<li>Container Tabs Sidebar
<ul class="org-ul">
<li>I usually prefar sidebery plugin but i want something minimalistic the website restore on startup</li>
</ul></li>
<li>ublock origin</li>
</ul>

<p>
Installing web progressive app can be done once it is enabled in the
settings
</p>

<p>
but when progressive app is open the Floorp instance with existing
session is also opened if it is not opened already which is annoying
</p>

<p>
Other than that it is great no need to dabble with chrome.css to
change UI (atleast for me, as my requirement is basic which comes with
browser options itself)
</p>

<p>
My browser needs are satisfied by
</p>
<ul class="org-ul">
<li>librewolf</li>
<li>floorp (sometimes)</li>
<li>chrome (If above two won't work as expected)</li>
</ul>
</div></article><footer>This site is made with ❤️ using Emacs.</footer></body></html>
